[
  {
    "id": 1,
    "name": "Технологии проектирования информационных систем и технологий",
    "description": "Технология проектирования ИС – это совокупность методов и средств проектирования ИС, а также совокупность методов и средств организации проектирования. Технология проектирования определяется как совокупность трех составляющих: пошаговой процедуры, определяющей последовательность технологических операций проектирования."
  },
  {
    "id": 2,
    "name": "Интеллектуальные системы и технологии",
    "description": "Изложены основные направления развития интеллектуальных систем. Рассмотрены модели представления знаний, основные компоненты экспертной системы и ее особенности, этапы разработки экспертных систем. Дано описание нейронных сетей. Представлен теоретический материал, посвященный эволюционным методам принятия решений."
  },
  {
    "id": 3,
    "name": "Управление информационной безопасностью",
    "description": "Это циклический процесс, включающий осознание степени необходимости защиты информации и постановку задач; сбор и анализ данных о состоянии информационной безопасности в организации; оценку информационных рисков; планирование мер по обработке рисков"
  },
  {
    "id": 4,
    "name": "Программная инженерия",
    "description": "Програ́ммная инжене́рия — приложение систематического, дисциплинированного, измеримого подхода к разработке, функционированию и сопровождению программного обеспечения, а также исследованию этих подходов; то есть, приложение дисциплины инженерии к программному обеспечению."
  },
  {
    "id": 5,
    "name": "Модели и методы оценки интеграционных решений",
    "description": "Интеграционные процессы в организациях являются одной из тенденций современного развития, во многом определяют соотношение конкурентных сил на рынке, а, следовательно, и конкурентоспособности его объектов. Исходя из этого, интеграция должна быть результативной и приводить к новому уровню развития организации, особенно если это касается стратегически значимых обрабатывающих отраслей экономики России, таких как судостроение, авиастроение и др., в интеграционных процессах которых государство является основной движущей силой и определяет формы реализации интеграции. Исследованию методов оценки эффективности интеграции в судостроении посвящена данная работа."
  }
]